TomAs-1226/Bezel/tab5/sdkconfig.defaults
# Catalyst Tab on the M5Stack Tab5. Values follow M5Stack's own Tab5 demo where it has one
# (docs/tab5-hardware.md); the rest are this firmware's choices.

CONFIG_IDF_TARGET="esp32p4"
# Tab5 units are silicon v1.x: 360 MHz, and an image built for v3.x won't run on them
CONFIG_ESP32P4_REV_MIN_1=y
# ESP-IDF 5.5.3 and later target v3 silicon unless told otherwise (5.5.1 doesn't know this symbol)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 32 MB PSRAM in the package: hex mode at 200 MHz (experimental in IDF), code executes from it too
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192

# LVGL reads tab5/lv_conf.h (passed as LV_CONF_PATH), not Kconfig
CONFIG_LV_CONF_SKIP=n

# The Tab5 BSP: two DPI frame buffers so the renderer flips on vsync instead of tearing; the
# renderer drives the panel itself, so the BSP's LVGL port stays unused
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2
CONFIG_BSP_SD_FORMAT_ON_MOUNT_FAIL=n

# The ESP32-C6 over SDIO (esp_hosted host, matching the C6's stock esp-hosted 1.4.x slave)
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y

# robot.local (Systemcore) and roborio-TEAM-frc.local resolve through mDNS
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y
CONFIG_LWIP_MAX_SOCKETS=16

# Camera: SC2356 driven as SC202CS, 1280x720 RAW8 through the ISP
CONFIG_CAMERA_SC202CS=y
CONFIG_CAMERA_SC202CS_MIPI_RAW8_1280X720_30FPS=y
CONFIG_CAMERA_SC202CS_MIPI_DEFAULT_FMT_RAW8_1280X720_30FPS=y

CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=4096
